Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/SUI_СообщенияОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияОбменаДанными</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.SUI_ВидыДанныхСообщенийОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сворачивать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщенияОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_РегламентныеЗадания.ПриСозданииНаСервере(ЭтотОбъект, SUI_СообщенияОбменаДанными);
	
	Если ПолучитьФункциональнуюОпцию("SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена") < 1 Тогда
		Элементы.СписокПоказатьОбработанныеСообщения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтображениеСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЗапуститьРегламентноеЗадание(Команда)
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ЗапуститьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	SUI_РегламентныеЗаданияКлиент.Подключаемый_ЗапуститьРегламентноеЗадание(Команда, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОбработанныеСообщения(Команда)
	
	Элементы.СписокПоказатьОбработанныеСообщения.Пометка = Не Элементы.СписокПоказатьОбработанныеСообщения.Пометка;
	
	УстановитьОтображениеСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ЗапуститьРегламентноеЗаданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеСообщений()
	
	Элементы.СписокКонтекстноеМенюПоказатьОбработанныеСообщения.Пометка = Элементы.СписокПоказатьОбработанныеСообщения.Пометка;
	
	Если Элементы.СписокПоказатьОбработанныеСообщения.Пометка Тогда
		
		Заголовок = НСтр("ru = 'Обработанные'");
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Список.Отбор, "Обработано", , ВидСравненияКомпоновкиДанных.Заполнено);
		
		Элементы.ДатаЗаписи.Видимость = Ложь;
		Элементы.СписокГруппаВидДанныхСворачивать.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Ложь;
		Элементы.Обработано.Видимость = Истина;
		Элементы.ОшибкаОбработки.Видимость = Истина;
		
	Иначе
		
		Заголовок = "";
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Список.Отбор, "Обработано", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		Элементы.ДатаЗаписи.Видимость = Истина;
		Элементы.СписокГруппаВидДанныхСворачивать.Видимость = Истина;
		Элементы.Приоритет.Видимость = Истина;
		Элементы.Обработано.Видимость = Ложь;
		Элементы.ОшибкаОбработки.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
